instancer-kirik/combocounter/embedded/nrf52840_main_complete.c
    Clay_RenderCommandArray render_commands = Clay_EndLayout();
    clay_epaper_render_commands(&g_clay_context, render_commands);
    clay_epaper_end_frame(&g_clay_context);
    display_mark_clean(&g_fitness_tracker);
}

static void render_header(const char* title) {
    CLAY(CLAY_ID("Header"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_FIXED(24)}, 
                     .padding = {4, 4}, .childAlignment = {CLAY_ALIGN_X_LEFT, CLAY_ALIGN_Y_CENTER})) {
        
        // Title
        CLAY_TEXT(CLAY_ID("HeaderTitle"), CLAY_STRING(title), 
                 CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
        
        // Battery level (right side)
        CLAY(CLAY_ID("BatteryContainer"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_FIXED(40), CLAY_SIZING_GROW()},
                         .childAlignment = {CLAY_ALIGN_X_RIGHT, CLAY_ALIGN_Y_CENTER})) {
            char battery_text[16];
            snprintf(battery_text, sizeof(battery_text), "%d%%", g_fitness_tracker.power.battery_level);
            CLAY_TEXT(CLAY_ID("BatteryText"), CLAY_STRING(battery_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 10));
        }
    }
}

static void render_footer(const char* left_text, const char* right_text) {
    CLAY(CLAY_ID("Footer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_FIXED(16)}, 
                     .padding = {4, 2})) {
        
        if (left_text) {
            CLAY_TEXT(CLAY_ID("FooterLeft"), CLAY_STRING(left_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 8));
        }
        
        if (right_text) {
            CLAY(CLAY_ID("FooterRightContainer"), 
                 CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()},
                             .childAlignment = {CLAY_ALIGN_X_RIGHT, CLAY_ALIGN_Y_CENTER})) {
                CLAY_TEXT(CLAY_ID("FooterRight"), CLAY_STRING(right_text),
                         CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 8));
            }
        }
    }
}

static void render_workout_select_screen(void) {
    CLAY(CLAY_ID("WorkoutSelectContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
        render_header("Select Workout");
        
        CLAY(CLAY_ID("WorkoutList"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                         .layoutDirection = CLAY_TOP_TO_BOTTOM, .padding = {8, 8}, .childGap = 4)) {
            
            const char* workouts[] = {"Push Day", "Pull Day", "Leg Day", "Custom"};
            for (int i = 0; i < 4; i++) {
                Clay_Color bg_color = (i == g_menu_selection) ? 
                    (Clay_Color){0.8f, 0.8f, 0.8f, 1.0f} : (Clay_Color){1.0f, 1.0f, 1.0f, 1.0f};
                
                CLAY(CLAY_IDI("WorkoutItem", i), 
                     CLAY_RECTANGLE(.color = bg_color),
                     CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_FIXED(20)}, 
                                 .padding = {4, 4})) {
                    CLAY_TEXT(CLAY_IDI("WorkoutText", i), CLAY_STRING(workouts[i]),
                             CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
                }
            }
        }
        
        render_footer("UP/DOWN: Navigate", "SELECT: Choose");
    }
}

static void render_exercise_list_screen(void) {
    CLAY(CLAY_ID("ExerciseListContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
        render_header("Exercises");
        
        if (g_fitness_tracker.current_workout.active) {
            CLAY(CLAY_ID("ExerciseList"), 
                 CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                             .layoutDirection = CLAY_TOP_TO_BOTTOM, .padding = {8, 8}, .childGap = 4)) {
                
                for (uint8_t i = 0; i < g_fitness_tracker.current_workout.total_exercises; i++) {
                    ExerciseSession* exercise = &g_fitness_tracker.current_workout.exercises[i];
                    Clay_Color bg_color = (i == g_fitness_tracker.current_workout.current_exercise) ? 
                        (Clay_Color){0.8f, 0.8f, 0.8f, 1.0f} : (Clay_Color){1.0f, 1.0f, 1.0f, 1.0f};
                    
                    CLAY(CLAY_IDI("ExerciseItem", i), 
                         CLAY_RECTANGLE(.color = bg_color),
                         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_FIXED(24)}, 
                                     .padding = {4, 4})) {
                        CLAY_TEXT(CLAY_IDI("ExerciseText", i), CLAY_STRING(exercise->exercise.name),
                                 CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
                        
                        // Show progress
                        char progress_text[32];
                        snprintf(progress_text, sizeof(progress_text), "%d/%d sets", 
                                exercise->current_set, exercise->total_sets);
                        CLAY_TEXT(CLAY_IDI("ExerciseProgress", i), CLAY_STRING(progress_text),
                                 CLAY_TEXT_CONFIG(.textColor = {0.5f, 0.5f, 0.5f, 1}, .fontSize = 10));
                    }
                }
            }
        }
        
        render_footer("SELECT: Start", "BACK: End Workout");
    }
}

static void render_active_set_screen(void) {
    if (!g_fitness_tracker.current_workout.active) return;
    
    uint8_t ex_idx = g_fitness_tracker.current_workout.current_exercise;
    ExerciseSession* exercise = &g_fitness_tracker.current_workout.exercises[ex_idx];
    Set* current_set = &exercise->sets[exercise->current_set];
    
    CLAY(CLAY_ID("ActiveSetContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
