instancer-kirik/combocounter/embedded/nrf52840_main_complete.c
        render_header(exercise->exercise.name);
        
        CLAY(CLAY_ID("SetInfo"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                         .layoutDirection = CLAY_TOP_TO_BOTTOM, .padding = {16, 16}, 
                         .childAlignment = {CLAY_ALIGN_X_CENTER, CLAY_ALIGN_Y_CENTER}, .childGap = 8)) {
            
            // Set number
            char set_text[32];
            snprintf(set_text, sizeof(set_text), "Set %d", exercise->current_set + 1);
            CLAY_TEXT(CLAY_ID("SetNumber"), CLAY_STRING(set_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 14));
            
            // Reps counter (large)
            char reps_text[32];
            snprintf(reps_text, sizeof(reps_text), "%d / %d", 
                    current_set->reps_completed, exercise->exercise.target_reps);
            CLAY_TEXT(CLAY_ID("RepsCounter"), CLAY_STRING(reps_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 24));
            
            // Weight
            char weight_text[32];
            snprintf(weight_text, sizeof(weight_text), "%.1f kg", 
                    (float)current_set->weight_used / 10.0f);
            CLAY_TEXT(CLAY_ID("WeightDisplay"), CLAY_STRING(weight_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 16));
            
            // Rep quality breakdown
            char quality_text[64];
            snprintf(quality_text, sizeof(quality_text), "Perfect: %d  Good: %d  Partial: %d", 
                    current_set->perfect_reps, current_set->good_reps, current_set->partial_reps);
            CLAY_TEXT(CLAY_ID("QualityBreakdown"), CLAY_STRING(quality_text),
                     CLAY_TEXT_CONFIG(.textColor = {0.5f, 0.5f, 0.5f, 1}, .fontSize = 10));
        }
        
        render_footer("UP: Perfect Rep", "SELECT: Complete Set");
    }
}

static void render_rest_timer_screen(void) {
    CLAY(CLAY_ID("RestTimerContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
        render_header("Rest Timer");
        
        CLAY(CLAY_ID("TimerDisplay"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                         .childAlignment = {CLAY_ALIGN_X_CENTER, CLAY_ALIGN_Y_CENTER})) {
            
            // Large timer display
            char timer_text[16];
            uint16_t minutes = g_fitness_tracker.rest_timer.remaining / 60;
            uint16_t seconds = g_fitness_tracker.rest_timer.remaining % 60;
            snprintf(timer_text, sizeof(timer_text), "%02d:%02d", minutes, seconds);
            
            Clay_Color timer_color = (g_fitness_tracker.rest_timer.remaining <= 10) ? 
                (Clay_Color){1.0f, 0.0f, 0.0f, 1.0f} : (Clay_Color){0, 0, 0, 1};
            
            CLAY_TEXT(CLAY_ID("TimerText"), CLAY_STRING(timer_text),
                     CLAY_TEXT_CONFIG(.textColor = timer_color, .fontSize = 32));
        }
        
        render_footer("SELECT: Skip Rest", "BACK: Return to Set");
    }
}

static void render_statistics_screen(void) {
    CLAY(CLAY_ID("StatsContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
        render_header("Statistics");
        
        CLAY(CLAY_ID("StatsList"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                         .layoutDirection = CLAY_TOP_TO_BOTTOM, .padding = {16, 16}, .childGap = 8)) {
            
            char stat_text[64];
            
            snprintf(stat_text, sizeof(stat_text), "Total Workouts: %lu", g_fitness_tracker.total_workouts);
            CLAY_TEXT(CLAY_ID("StatWorkouts"), CLAY_STRING(stat_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
            
            snprintf(stat_text, sizeof(stat_text), "Total Sets: %lu", g_fitness_tracker.total_sets);
            CLAY_TEXT(CLAY_ID("StatSets"), CLAY_STRING(stat_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
            
            snprintf(stat_text, sizeof(stat_text), "Total Reps: %lu", g_fitness_tracker.total_reps);
            CLAY_TEXT(CLAY_ID("StatReps"), CLAY_STRING(stat_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
            
            snprintf(stat_text, sizeof(stat_text), "Total Volume: %.1f kg", 
                    (float)g_fitness_tracker.total_volume / 10.0f);
            CLAY_TEXT(CLAY_ID("StatVolume"), CLAY_STRING(stat_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
        }
        
        render_footer("", "BACK: Return");
    }
}

static void render_settings_screen(void) {
    CLAY(CLAY_ID("SettingsContainer"), 
         CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                     .layoutDirection = CLAY_TOP_TO_BOTTOM)) {
        
        render_header("Settings");
        
        CLAY(CLAY_ID("SettingsList"), 
             CLAY_LAYOUT(.sizing = {CLAY_SIZING_GROW(), CLAY_SIZING_GROW()}, 
                         .layoutDirection = CLAY_TOP_TO_BOTTOM, .padding = {16, 16}, .childGap = 8)) {
            
            // Auto rest setting
            char auto_rest_text[32];
            snprintf(auto_rest_text, sizeof(auto_rest_text), "Auto Rest: %s", 
                    g_fitness_tracker.auto_start_rest ? "ON" : "OFF");
            CLAY_TEXT(CLAY_ID("AutoRestSetting"), CLAY_STRING(auto_rest_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
            
            // Vibration setting
            char vibration_text[32];
            snprintf(vibration_text, sizeof(vibration_text), "Vibration: %s", 
                    g_fitness_tracker.vibrate_enabled ? "ON" : "OFF");
            CLAY_TEXT(CLAY_ID("VibrationSetting"), CLAY_STRING(vibration_text),
                     CLAY_TEXT_CONFIG(.textColor = {0, 0, 0, 1}, .fontSize = 12));
        }
        
        render_footer("UP/DOWN: Navigate", "SELECT: Toggle");
    }
}

